---
type: MessageBoxData
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# MessageBoxData

`Autodesk.Revit.UI.Events.MessageBoxData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DialogType | — | `public int DialogType { get ; }` |
| Property | Message | — | `public string Message { get ; }` |